import torch


tensor_a = torch.tensor([[1, 2, 3, 4],
                         [5, 6, 7, 8]])

tensor_b = torch.tensor([[0, 0, 0, 0],
                         [1, 1, 1, 1]])

print(tensor_b * tensor_a)

tensor_a = [3648, 1279, 2436, 641, 3671, 3101, 2057, 1362, 353, 1287, 1628, 490, 103, 1957, 824, 3027, 1262, 2859, 3552,
            1303, 3044, 366, 1325, 2738, 3521, 2572, 2940, 1628, 366, 1325, 841, 1790, 3325, 1303, 658, 1025, 1937, 3722,
            574, 1628, 2700, 2346, 3057, 3395, 196, 1368, 939, 658, 115, 3465, 2920, 2492, 284, 3529, 899, 693, 115,
            1914, 3002, 3531, 972, 1618, 115, 1541, 50, 2367, 1703, 1362, 2653, 249, 1679, 1102, 6353, 2058, 722, 284,
            3333, 2984, 2026, 2379, 1957, 824, 3027, 1262, 1628, 825, 424]

tensor_b = '实 际 上 这 取 决 于 你 居 住 的 地 方 医 疗 保 险 是 一 个 由 联 邦 政 府 管 理 的 联 邦 计 划 每 个 州 都 有 自 己 的 系 统' \
           ' 并 且 要 求 因 州 而 异 也 可 能 随 时 间 而 变 化 但 平 均 而 言 在 美 国 你 必 须 到 了 65 岁 才 能 符 合 获 得 医 疗 保' \
           ' 险 的 资 格'

print(len(tensor_a))
print(len(tensor_b))

import random
ran = random.sample(range(len(tensor_a)), k=1)
print(ran)

i = 4
print(list(range(0, i)) + list(range(i+1, 8)))
